app/views/users/show.html.erb

<div class="photo-collection">
  <% @photos = Photo.where(undergrad_id: current_user.id) %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."undergrad_id" = ?  [["undergrad_id", 1]]