app/views/photos/_photo.js.erb


$(".upload-photo").on("click", function(){

  cloudinary.openUploadWidget({ cloud_name: 'keepyourfriendsclose', upload_preset: 'wqsntyaq', max_files: 1},

    function(error, result) {
      photos.push(result);

      var url = photos[(photos.length-1)][0].secure_url

      var user_id = $(".photo-stream").attr("data-user-id")
      $.ajax({
        url: "/users/"+user_id+"/photos",
        type: "post",
        dataType: "json",
        data: {url: url, user_id: user_id}
      }).done(function(response){
        console.log("success");
        $(".photo-stream").append("<div class='photo'>
      <img src='"+response.url+"'></div>")
      })
    });
---
SELECT "photos".* FROM "photos"