app/controllers/colleges_controller.rb

  def newsfeed
    @bookmarks = Bookmark.where(user_id: current_user.id)
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = ?  [["user_id", 1]]

  def explore
    @selected_schools = []
    College.all.each do |college|
---
SELECT "colleges".* FROM "colleges"

  def show
    @college = College.find(params[:id])
    @photos = @college.photos
    # @people = Undergrad.where(college_id: @college.id)

    #include how many students have bookmarked it
    @num_bookmarks = Bookmark.where(college_id: @college.id).count
---
SELECT  "colleges".* FROM "colleges" WHERE "colleges"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "bookmarks" WHERE "bookmarks"."college_id" = ?  [["college_id", 1]]