app/controllers/photos_controller.rb

  def index
    @photos = Photo.all
---
SELECT  "photos".* FROM "photos"  ORDER BY "photos"."id" ASC LIMIT 1

  def create
    @photo = Photo.create(url: params[:url], undergrad_id: params[:user_id])
---
INSERT INTO "photos" ("url", "undergrad_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)