app/controllers/users_controller.rb

INSERT INTO "users" ("type", "name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(type: params[:type], name: params[:name], email: params[:email], password: params[:password])
    if @user.save